const ISO_MAPPING = {
  260: '%A1', //Ą
  728: '%A2', //˘
  321: '%A3', //Ł
  317: '%A5', //Ľ
  346: '%A6', //Ś
  352: '%A9', //Š
  350: '%AA', //Ş
  356: '%AB', //Ť
  377: '%AC', //Ź
  381: '%AE', //Ž
  379: '%AF', //Ż
  261: '%B1', //ą
  731: '%B2', //˛
  322: '%B3', //ł
  318: '%B5', //ľ
  347: '%B6', //ś
  711: '%B7', //ˇ
  353: '%B9', //š
  351: '%BA', //ş
  357: '%BB', //ť
  378: '%BC', //ź
  733: '%BD', //˝
  382: '%BE', //ž
  380: '%BF', //ż
  340: '%C0', //Ŕ
  258: '%C3', //Ă
  313: '%C5', //Ĺ
  262: '%C6', //Ć
  268: '%C8', //Č
  280: '%CA', //Ę
  282: '%CC', //Ě
  270: '%CF', //Ď
  272: '%D0', //Đ
  323: '%D1', //Ń
  327: '%D2', //Ň
  336: '%D5', //Ő
  344: '%D8', //Ř
  366: '%D9', //Ů
  368: '%DB', //Ű
  354: '%DE', //Ţ
  341: '%E0', //ŕ
  259: '%E3', //ă
  314: '%E5', //ĺ
  263: '%E6', //ć
  269: '%E8', //č
  281: '%EA', //ę
  283: '%EC', //ě
  271: '%EF', //ď
  273: '%F0', //đ
  324: '%F1', //ń
  328: '%F2', //ň
  337: '%F5', //ő
  345: '%F8', //ř
  367: '%F9', //ů
  369: '%FB', //ű
  355: '%FE', //ţ
  729: '%FF', //˙
};

export function escapeIso88592(s: string) {
  let out = '';

  for (let i = 0; i < s.length; i++) {
    const c = s.charCodeAt(i);
    let part = s.charAt(i);

    if (c === 3) {
      part = '+';
    } else if ((c >= 48 && c <= 57) || (c >= 65 && c <= 90) || (c >= 97 && c <= 122)) {
      //do not encode numbers and letters
    } else
      part = ISO_MAPPING[c] ?? `%${c.toString(16).toUpperCase()}`;

    out += part;
  }

  return out;
}
